import { IDataOrderPlace } from "./dataTypes"

const dataOrderPlace: IDataOrderPlace[] = [
  {
    city: {
      name: "Ульяновск",
      coord: [54.314192, 48.403132]
    },
    streets: [
      {
        name: "Нариманова, 42",
        coord: [54.352893, 48.366669]
      },
      {
        name: "Почтовая, 16",
        coord: [54.329924, 48.476884]
      },
      {
        name: "Шигаева, 22",
        coord: [54.266615, 48.272229]
      },
      {
        name: "Урицкого, 29",
        coord: [54.332082, 48.369131]
      }
    ]
  },
  {
    city: {
      name: "Новосибирск",
      coord: [55.030204, 82.92043]
    },
    streets: [
      {
        name: "Падунская, 12",
        coord: [55.072917, 82.925703]
      },
      {
        name: "Доватора, 11",
        coord: [55.046842, 82.997056]
      },
      {
        name: "Николая Сотникова, 14",
        coord: [54.944244, 82.972658]
      },
      {
        name: "Станционная, 89",
        coord: [54.995462, 82.806883]
      }
    ]
  },
  {
    city: {
      name: "Челябинск",
      coord: [55.159902, 61.402554]
    },
    streets: [
      {
        name: "Молодогвардейцев, 2В",
        coord: [55.207295, 61.31769]
      },
      {
        name: "Победы, 2Бк1",
        coord: [55.193843, 61.464412]
      },
      {
        name: "Бугурусланская, 62",
        coord: [55.106933, 61.489933]
      },
      {
        name: "Громова, 3",
        coord: [55.039496, 61.37785]
      }
    ]
  },
  {
    city: {
      name: "Благовещенск",
      coord: [50.257456, 127.534611]
    },
    streets: [
      {
        name: "Фрунзе, 40",
        coord: [50.251363, 127.562504]
      },
      {
        name: "Ленина, 192",
        coord: [50.264442, 127.486381]
      },
      {
        name: "Нагорная, 8",
        coord: [50.275496, 127.477694]
      },
      {
        name: "Воронкова, 8/А4",
        coord: [50.304554, 127.526832]
      }
    ]
  },
  {
    city: {
      name: "Красноярск",
      coord: [56.010569, 92.852572]
    },
    streets: [
      {
        name: "Фруктовая, 16",
        coord: [56.040033, 92.749221]
      },
      {
        name: "Светлогорский переулок, 4",
        coord: [56.061961, 92.905626]
      },
      {
        name: "26 Бакинских Комиссаров, 10",
        coord: [56.032046, 93.025785]
      },
      {
        name: "Аральская, 10",
        coord: [55.990061, 93.007235]
      }
    ]
  }
]

export default dataOrderPlace
