import { IAddressSearch } from "./dataTypes"

const dataSearchPlace: IAddressSearch[] = [
  {
    city: "Ульяновск",
    streets: ["Нариманова, 42", "Почтовая, 16", "Урицкого, 29", "Шигаева, 22"]
  },
  {
    city: "Новосибирск",
    streets: ["Падунская, 12", "Доватора, 11", "Николая Сотникова, 14", "Станционная, 89"]
  },
  {
    city: "Челябинск",
    streets: ["Молодогвардейцев, 2В", "Победы, 2Бк1", "Бугурусланская, 62", "Громова, 3"]
  },
  {
    city: "Благовещенск",
    streets: ["Фрунзе, 40", "Ленина, 192", "Нагорная, 8", "Воронкова, 8/А4"]
  },
  {
    city: "Красноярск",
    streets: [
      "Фруктовая, 16",
      "Светлогорский переулок, 4",
      "26 Бакинских Комиссаров, 10",
      "Аральская, 10"
    ]
  }
]

export default dataSearchPlace
